Repository: keyBeatz/css-js-minify
Catalog: languages/css-js-minify-*.po
Languages: cs_cz

source: Error, minified files could not be generated. Please try again.
cs_cz: Chyba, soubory se nepovedlo vygenerovat, zkuste to prosím znovu.

source: You probably trying to delete all blocks. To achieve this please use button Delete All.
cs_cz: Patrně se snažíte vše smazat, k tomu prosím použijte tlačítko smazat vše.

source: Successfully deleted.
cs_cz: Data byla úspěšně smazána.

source: Successfully saved.
cs_cz: Úspěšně uloženo

source: Do you really want to generate new files? The old ones will be deleted.
cs_cz: Chcete opravdu uložit tyto bloky a vygenerovat nové soubory? Staré budou tímto smazány nebo přepsány.

source: Do you really want to delete this block?
cs_cz: Chcete opravdu smazat tento blok?

source: Do you really want to delete all blocks?
cs_cz: Chcete opravdu smazat všechny bloky?

source: CSS & JS minify & concat settings
cs_cz: CSS & JS minifikátor - nastavení

source: Move file block left
cs_cz: Posunout blok doleva

source: Move file block right
cs_cz: Posunout blok doprava

source: Show file block settings
cs_cz: Zobrazit nastavení bloku

source: Remove file block
cs_cz: Smazat blok

source: Hide settings
cs_cz: Schovat nastavení

source: Load asynchronously
cs_cz: Načíst asynchronně

source: Priority
cs_cz: Priorita

source: In footer
cs_cz: V patičce

source: Dependencies
cs_cz: Závislosti

source: Move file boxes here
cs_cz: Přesuňte bloky sem

source: You need to load the existing files first, please visit
cs_cz: První se musí načíst existující soubory, prosím navštivte znovu

source: your webpage
cs_cz: svůj web

source: All boxes have been already assigned.
cs_cz: Všechny boxy byly rozděleny

source: Generate files
cs_cz: Vygenerovat soubory

source: Erase all files
cs_cz: Zrušit všechny soubory

source: Show guidance
cs_cz: Zobrazit nápovědu

source: Turn on/off %s
cs_cz: Zapnout/vypnout %s

source: Click to add a new file block
cs_cz: Klikněte pro přidání nového bloku (souboru)

source: Add a file block
cs_cz: Přidejte blok (soubor)

source: CSS & JS Minify - guide
cs_cz: CSS & JS Minify - nápověda

source: Introduction
cs_cz: Úvod

source: Tabs
cs_cz: Záložky

source: Buttons
cs_cz: Tlačítka

source: Blocks
cs_cz: Bloky

source: Boxes
cs_cz: Boxy

source: Welcome to our community plugin guide.
cs_cz: Vítejte v nápovědě našeho komunitního pluginu.

source: This guide will walk you through functions, features and terms used in this plugin.
cs_cz: V tomto návodě se dozvíte vše potřebné ohledně funkcí a možností tohoto pluginu.

source: I believe, this plugin provides the most user-friendly way of defining, minifying and concatenating of your existing CSS & JS files among all existing possibilities (other plugins).
cs_cz: Věřím, že nabízíme nejvíce uživatelsky přívětivou cestu definování vlastních minifikovaných souborů z pohodlí administrace WordPress.

source: However, if you encounter any bugs, fell free to send a report to the author - you can find contact information on GitHub or on the WordPress plugin page.
cs_cz: Avšak pokud narazíte na nějaké chyby, kontaktuje mě prosím s reportem - kontaktní informace naleznete na stránce pluginu.

source: Each tab stands for a separate section - every section is set independently of others.
cs_cz: Záložky slouží pro oddělení jednotlivých sekcí, z níchž každá se nastavuje zvlášť.

source: providing minification & concatenation options and settings for your registered cascading styles.
cs_cz: slouží pro sestavovaní minifikovaných souborů pro styly

source: providing minification & concatenation options and settings for your registered javascript files.
cs_cz: slouží pro sestavovaní minifikovaných souborů pro skripty

source: Each button represents a certain action over the tab.
cs_cz: Tlačítka reprezentují vždy určité akce, které se vážou buďto k dané záložce.

source: Save
cs_cz: Uložit

source: will generate minified files sorted by block positions and positions of their boxes.
cs_cz: vygeneruje minifikované soubory dle naskládaných bloků a jejich boxů

source: will erase all existing blocks within the current tab. You also need to click the 'Save' button to make the effect permanent
cs_cz: smaže všechny bloky dané záložky, ale pro trvalý efekt je třeba ještě uložit

source: Help
cs_cz: Nápověda

source: will show this guide.
cs_cz: zobrazí tuto nápovědu

source: Switch (on/off)
cs_cz: Přepínač vypnuto/zapnuto

source: is placed at the top right corner and is used to turn loading of the minified files on and off (always set separately for each tab).
cs_cz: je umístěný úplně vpravo v hlavičce záložky a slouží pro vypnutí a zapnutí minifikátoru (vždy pro záložku zvlášť, takže lze mít zaplé css zatímco js je vyplé)

source: Please note: with this switch turned on, logger of new files will not be loading - if you need to load new files (eg. if you installed new plugin) you must turn off this switch first.
cs_cz: Poznámka: když máte tento přepínač zapnutý, logování (načítání) nových souborů bude vypnuto - pokud potřebujete načíst nové soubory (např. pokud nainstalujete nový plugin a ten přidá css/js), musíte první tento přepínač vypnout

source: Each block represents one minified file.
cs_cz: Blok reprezentuje jeden soubor.

source: First red block is the init base block. It contains all registered styles/script files, which can be sorted from here to your custom defined blocks.
cs_cz: První blok (červený), obsahuje výchozí registrované styly, které jde volně rozřazovat do bloků.

source: Boxes in the red block are still loaded (when the minification switch is turned on) and their default order is based on their original loading priorities in WordPress.
cs_cz: Boxy v červeném bloku se načítají jako obvykle (když je přepínač pro záložku zapnutý) a jsou seřazeny dle svých originální priorit ve WordPress.

source: Every custom block (grey coloured) can contain an infinite number of boxes.
cs_cz: Každý (šedý) blok může obsahovat libovolný počet boxů.

source: The order of blocks matters. Position of a block defines loading priority (by default) - higher priority on the left. However, you can override priorities in block settings.
cs_cz: Na pořadí bloků záleží, jelikož určují prioritu načítání (lze měnit).

source: Block buttons have these functions
cs_cz: Tlačítka bloků mají tyto funkce

source: Arrow left/right
cs_cz: Šipka vlevo/vpravo

source: move block in desired direction - it will determine blocks loading priorities - the leftmost block has the highest priority, you can however change priority manually in block settings.
cs_cz: posouvání bloku určeným směrem, takto můžete vybírat prioritu načítání (první blok vlevo se bude načítat jako první)

source: Gear
cs_cz: Ozubené kolo

source: this opens the block settings. Settings options differ for CSS and JS. For CSS you can choose media. For JS you can select whether file will be included in the header or in the footer. You can set asynchronous or deferred loading for both CSS and JS.
cs_cz: nastavení pro daný blok (většinou se nastavují atributy, pro CSS media a pro JS např. to, jestli se má blok načítat v patičce nebo v hlavičce dokumentu)

source: Basket
cs_cz: Koš

source: will delete the block. You also need to save everything with the 'Save' button to make changes permanent.
cs_cz: smaže blok (pro úplné smazání je třeba uložit)

source: One box represents one file loaded by WordPress.
cs_cz: Box reprezentuje jeden soubor, který byl načtený WordPressem.

source: In the initial state all boxes are placed in the red block (init base block) in deactivated state and sorted by their default loading priorities.
cs_cz: Ve výchozím stavu jsou načteny všechny vlevo v oranžovém boxu, kde jsou "deaktivované" pro minifikátor a načítají se dle svého původního nastavení.

source: If plugin minification is enabled (switch is turned on) boxes placed in red init box will be loaded by WordPress as usual.
cs_cz: Pokud je minifikace zaplá (přepínač je zelený) boxy umístěné v červeném bloku se budou načítat jako obvykle.

source: Notice a little grey number in the top left corner - it holds the original priority order - e.g. 3 was loaded before 5.
cs_cz: Všimněte si šedého čísla v levém horním rohu - značí originální pozici dle WordPress načítání a priorit (př. 3 byla originálně načtena před 5)

source: You should always take this number as a guide and order boxes in your custom blocks by it.
cs_cz: Vždy by jste měli brát tyto čísla v potaz a řadit boxy dle nich.

source: Under the priority number, there are a couple of labels helping you to decide where should the box be placed.
cs_cz: Pod číslem priority naleznete několik štítků, které vám pomohou s rozhodováním v jakém pořadí by měly být boxy seřazeny

source: Grey label stands for the file version and is not that important.
cs_cz: Šedý štítek pak znamená verzi souboru.

source: Hint
cs_cz: Nápověda

source: CSS with the same media (green) label and JS with 'in footer' (red) label should always be together - in most cases.
cs_cz: CSS se stejným media štítkem (zelený) a JS se štítkem 'in footer' (červený)" by měly být vě většině případů spolu v jednom bloku.

source: On the right you can find an arrow, which will show additional data like url path.
cs_cz: V právé části můžete najít šipku, který zobrazí další užitečná data, jako url nebo závislosti.

source: Important
cs_cz: Důležite

source: Positions of boxes within their block will determine the priority of that same file upon concatenation.
cs_cz: Pozice boxů v rámci bloku určují prioritu toho v jakém pořadí se soubory spojí ve výsledném souboru

source: Always decide by the priority number (in the top left corner), when deciding upon the box positioning - because files that were loaded earlier may be (and often are) overridden by files that are loaded later.
cs_cz: Vždy se rozhodujte podle čísla priority (v levém horním rohu), protože soubory, které byly načteny dříve často bývají přepsány těmi co se načítají později.

source: We are working on debugging tools to provide you easy and friendly way of selecting right order of files (boxes & blocks).
cs_cz: Pracujeme na debugovacích nástrojích aby jsme vám poskytli jetště lepší uživatelský zážitek.

source: Meanwhile (for JS) I recommend to use your browser console - if there are no errors, everything is ok.
cs_cz: Mezi tím (pro JS) doporučuji použít konzoli v prohlížeči - pokud tam nebudou žádne errory, mělo by být všechno v pořádku.

source: For CSS you should check site if everything is displaying as it should.
cs_cz: S CSS soubory vždy zkontrolujte, jestli se vše zobrazuje jak má.

source: Please read through this guide first then you should have no problem with setting the right order of files.
cs_cz: Prosím pročtěte si tuto nápovědu a pak by neměl být problém nastavit správné pořadí všech souborů.
